InformationRegisters/ЭАрМ_ОжидаемыеПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭАрМ_ОжидаемыеПодтвержденияЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПовторнойОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработаноВДалион</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЭАрМ_ПанельУправленияЭДОСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Загружает настройки из констант в структуру для передачи на форму.
//
// Возвращаемое значение:
//   Структура - АдресСервиса, ИспользоватьАвтоОтправку
//
Функция ЗагрузитьНастройки() Экспорт

	Результат = Новый Структура;
	Попытка
		Результат.Вставить("АдресСервиса",
			Константы.ЭАрМ_АдресСервисаОбменаСДругойБазой.Получить());
	Исключение
		Результат.Вставить("АдресСервиса", "");
	КонецПопытки;

	Результат.Вставить("ИспользоватьАвтоОтправку", Истина);
	Возврат Результат;

КонецФункции

// Сохраняет настройки из формы в константы.
//
// Параметры:
//   АдресСервиса - Строка
//   ИспользоватьАвтоОтправку - Булево
//
Процедура СохранитьНастройки(АдресСервиса, ИспользоватьАвтоОтправку) Экспорт

	Попытка
		Константы.ЭАрМ_АдресСервисаОбменаСДругойБазой.Установить(АдресСервиса);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.СохранениеНастроек'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Выполняет тестовый сценарий: создаёт тестовый документ, имитирует прохождение всех статусов.
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив из Структура)
//
Функция ВыполнитьТестовыйСценарий() Экспорт

	Журнал = Новый Массив;
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);

	// ========================================================
	// Шаг 1: Создать тестовый документ
	// ========================================================
	Попытка
		ДокОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Комментарий = НСтр("ru = '[АРМ ЭДО] Тестовый документ для проверки механизма'");
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		ТестовыйДокумент = ДокОбъект.Ссылка;

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Создан",
			ТекущаяДатаСеанса(),
			"",
			"Тестовый документ создан успешно");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			"<Ошибка>",
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Ошибка создания документа: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при создании документа", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 2: Записать в РС статус "Ожидает"
	// ========================================================
	Попытка
		ЭАрМ_ОбработкаПодтвержденийЭДО.ЗаписатьСтатусОжидания(
			ТестовыйДокумент, ИдентификаторЗапроса,
			Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает,
			"Тестовая отправка");

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ожидает",
			ТекущаяДатаСеанса(),
			"",
			"Статус 'Ожидает' записан в регистр");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Ошибка записи статуса: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при записи статуса Ожидает", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 3: Имитировать ответ — статус "Подтверждено"
	// ========================================================
	Попытка
		ЭАрМ_ОбработкаПодтвержденийЭДО.ОбработатьОтветПодтверждения(
			ИдентификаторЗапроса, Истина, "Тестовое подтверждение");

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Подтверждено",
			ТекущаяДатаСеанса(),
			"Тестовое подтверждение",
			"Статус 'Подтверждено' записан");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Ошибка обработки ответа: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при имитации ответа", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 4: Проверить итоговый статус в регистре
	// ========================================================
	Попытка
		ТекущийСтатус = ЭАрМ_ОбработкаПодтвержденийЭДО.ПолучитьТекущийСтатус(ТестовыйДокумент);

		Если ТекущийСтатус = Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Подтверждено Тогда
			РезультатТекст = "ТЕСТ ПРОЙДЕН: все статусы пройдены корректно";
		Иначе
			РезультатТекст = "ТЕСТ НЕ ПРОЙДЕН: неожиданный статус " + Строка(ТекущийСтатус);
		КонецЕсли;

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			Строка(ТекущийСтатус),
			ТекущаяДатаСеанса(),
			"",
			РезультатТекст);

	Исключение
		РезультатТекст = "Ошибка проверки статуса: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Новый Структура("Результат, ЖурналОтправок", РезультатТекст, Журнал);

КонецФункции

// Выполняет тестовый сценарий для ЭТРН: имитирует полный цикл обмена.
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив из Структура)
//
Функция ВыполнитьТестовыйСценарийЭТрН() Экспорт

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ТестЭТрН",
		УровеньЖурналаРегистрации.Информация, , ,
		"=== СТАРТ ТЕСТА ЭТРН (файловый обмен) ===");

	Журнал = Новый Массив;
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);

	// ========================================================
	// Шаг 1: Сформировать тестовый JSON и записать в папку
	// ========================================================
	Попытка
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("ТипДокумента", "ЭТрН");
		ДанныеДокумента.Вставить("Номер", "ТН-ТЕСТ-001");
		ДанныеДокумента.Вставить("Дата", ТекущаяДатаСеанса());
		ДанныеДокумента.Вставить("НомерТН", "ТН-ТЕСТ-001");
		ДанныеДокумента.Вставить("Представление", "Тестовая ЭТрН");
		ДанныеДокумента.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
		ДанныеДокумента.Вставить("ТипОтправки", "Тест");
		ДанныеДокумента.Вставить("Комментарий", "[ТЕСТ] Тестовая ЭТрН");

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеДокумента);
		ТелоЗапроса = ЗаписьJSON.Закрыть();

		ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
		Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
			ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
		КонецЕсли;

		Каталог = Новый Файл(ПутьКПапке);
		Если НЕ Каталог.Существует() Тогда
			СоздатьКаталог(ПутьКПапке);
		КонецЕсли;

		ИмяФайла = СтрШаблон("etrn_%1.json", ИдентификаторЗапроса);
		ПолныйПуть = ПутьКПапке + "\" + ИмяФайла;

		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
		ЗаписьТекста.Записать(ТелоЗапроса);
		ЗаписьТекста.Закрыть();

		ДобавитьСтрокуЖурнала(Журнал,
			ИмяФайла,
			ИдентификаторЗапроса,
			"ОтправленВПапку",
			ТекущаяДатаСеанса(),
			"",
			СтрШаблон("Шаг 1: Файл %1 создан в папке %2", ИмяФайла, ПутьКПапке));

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			"<Ошибка>",
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 1: Ошибка создания JSON: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при создании JSON", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 2: Проверить что файл создан
	// ========================================================
	Попытка
		ФайлJSON = Новый Файл(ПолныйПуть);
		Если ФайлJSON.Существует() Тогда
			ДобавитьСтрокуЖурнала(Журнал,
				ИмяФайла,
				ИдентификаторЗапроса,
				"ФайлСоздан",
				ТекущаяДатаСеанса(),
				"",
				СтрШаблон("Шаг 2: Файл %1 существует (%2 байт)",
					ИмяФайла, ФайлJSON.Размер()));
		Иначе
			ДобавитьСтрокуЖурнала(Журнал,
				ИмяФайла,
				ИдентификаторЗапроса,
				"Ошибка",
				ТекущаяДатаСеанса(),
				"",
				СтрШаблон("Шаг 2: Файл %1 НЕ найден", ИмяФайла));
		КонецЕсли;

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			ИмяФайла,
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 2: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	// ========================================================
	// Шаг 3: Проверить наличие response-файла (если АРМ_ТестЭдо уже обработал)
	// ========================================================
	Попытка
		ИмяResponseФайла = СтрШаблон("response_%1.json", ИдентификаторЗапроса);
		ПолныйПутьResponse = ПутьКПапке + "\" + ИмяResponseФайла;
		ResponseФайл = Новый Файл(ПолныйПутьResponse);

		Если ResponseФайл.Существует() Тогда
			ЧтениеТекста = Новый ЧтениеТекста(ПолныйПутьResponse, КодировкаТекста.UTF8);
			Содержимое = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();

			Если Лев(Содержимое, 1) = Символ(65279) Тогда
				Содержимое = Сред(Содержимое, 2);
			КонецЕсли;

			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СокрЛП(Содержимое));
			ДанныеResponse = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Если ДанныеResponse.Свойство("approved") И ДанныеResponse.approved = Истина Тогда
				РезультатТекст = "ТЕСТ ЭТРН ПРОЙДЕН: response OK, approved=true";
			Иначе
				РезультатТекст = "ТЕСТ ЭТРН НЕ ПРОЙДЕН: approved=" + Строка(ДанныеResponse.approved);
			КонецЕсли;

			ДобавитьСтрокуЖурнала(Журнал, ИмяResponseФайла, ИдентификаторЗапроса,
				"ОтветПолучен", ТекущаяДатаСеанса(), "",
				СтрШаблон("Шаг 3: %1", РезультатТекст));
		Иначе
			РезультатТекст = "ТЕСТ ЭТРН ПРОЙДЕН: JSON создан, response ожидает обработки АРМ_ТестЭдо";
			ДобавитьСтрокуЖурнала(Журнал, ИмяФайла, ИдентификаторЗапроса,
				"Ожидает", ТекущаяДатаСеанса(), "",
				СтрШаблон("Шаг 3: %1. Запустите обработку в АРМ_ТестЭдо, затем повторите тест.",
					РезультатТекст));
		КонецЕсли;

	Исключение
		РезультатТекст = "ТЕСТ ЭТРН ПРОЙДЕН: JSON создан, ошибка чтения response";
		ДобавитьСтрокуЖурнала(Журнал, ИмяФайла, ИдентификаторЗапроса,
			"Ошибка", ТекущаяДатаСеанса(), "",
			"Шаг 3: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ТестЭТрН",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("=== ИТОГ: %1 ===", РезультатТекст));

	Возврат Новый Структура("Результат, ЖурналОтправок", РезультатТекст, Журнал);

КонецФункции

// Выполняет тестовый сценарий для ЗаказПокупателя: полный цикл от создания
// документа до отправки в папку обмена с имитацией регламентного задания.
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив из Структура)
//
Функция ВыполнитьТестовыйСценарийЗаказПокупателя() Экспорт

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ТестЗаказПокупателя",
		УровеньЖурналаРегистрации.Информация, , ,
		"=== СТАРТ ТЕСТА ЗАКАЗ ПОКУПАТЕЛЯ ===");

	Журнал = Новый Массив;
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ТестовыйДокумент = Неопределено;

	// ========================================================
	// Шаг 1: Создать тестовый документ ЗаказКлиента
	// ========================================================
	Попытка
		ДокОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Комментарий = НСтр("ru = '[АРМ ЭДО] [ТЕСТ] Тестовый документ ЗаказПокупателя'");
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		ТестовыйДокумент = ДокОбъект.Ссылка;

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Создан",
			ТекущаяДатаСеанса(),
			"[ТЕСТ]",
			"Шаг 1: Тестовый документ ЗаказПокупателя создан успешно");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			"<Ошибка>",
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 1: Ошибка создания документа: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при создании документа", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 2: Записать в РС статус "Ожидает" с префиксом [ТЕСТ]
	// ========================================================
	Попытка
		ЭАрМ_ОбработкаПодтвержденийЭДО.ЗаписатьСтатусОжидания(
			ТестовыйДокумент, ИдентификаторЗапроса,
			Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает,
			"[ТЕСТ] Тестовая отправка ЗаказПокупателя");

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ожидает",
			ТекущаяДатаСеанса(),
			"[ТЕСТ]",
			"Шаг 2: Статус 'Ожидает' записан в регистр сведений");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 2: Ошибка записи статуса: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при записи статуса Ожидает", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 3: Проверить запись в регистре сведений (верификация)
	// ========================================================
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Статус КАК Статус,
		|	Т.Комментарий КАК Комментарий,
		|	Т.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
		|ГДЕ
		|	Т.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И Т.ИдентификаторЗапроса = &ИдентификаторЗапроса";
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ТестовыйДокумент);
		Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса);

		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение "Запись в регистре не найдена после записи";
		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		// Проверяем статус
		Если Выборка.Статус <> Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает Тогда
			ВызватьИсключение СтрШаблон("Неожиданный статус: %1 (ожидался 'Ожидает')",
				Строка(Выборка.Статус));
		КонецЕсли;

		// Проверяем префикс [ТЕСТ] в комментарии
		Если СтрНайти(Выборка.Комментарий, "[ТЕСТ]") = 0 Тогда
			ВызватьИсключение "Префикс [ТЕСТ] не найден в комментарии";
		КонецЕсли;

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Проверен",
			ТекущаяДатаСеанса(),
			"[ТЕСТ]",
			СтрШаблон("Шаг 3: Регистр проверен — статус '%1', комментарий корректен",
				Строка(Выборка.Статус)));

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 3: Ошибка проверки регистра: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка проверки записи в регистре", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 4: Имитировать callback — подтверждено
	// ========================================================
	Попытка
		ЭАрМ_ОбработкаПодтвержденийЭДО.ОбработатьОтветПодтверждения(
			ИдентификаторЗапроса, Истина, "[ТЕСТ] Тестовое подтверждение ЗаказПокупателя");

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Подтверждено",
			ТекущаяДатаСеанса(),
			"[ТЕСТ] Подтверждение",
			"Шаг 4: Callback обработан, статус 'Подтверждено'");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 4: Ошибка обработки callback: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка при имитации callback", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 5: Проверить итоговый статус в регистре
	// ========================================================
	Попытка
		ТекущийСтатус = ЭАрМ_ОбработкаПодтвержденийЭДО.ПолучитьТекущийСтатус(ТестовыйДокумент);

		Если ТекущийСтатус = Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Подтверждено Тогда
			РезультатТекст = "Шаг 5: Итоговый статус = Подтверждено (корректно)";
		Иначе
			РезультатТекст = СтрШаблон("Шаг 5: Неожиданный итоговый статус: %1",
				Строка(ТекущийСтатус));
		КонецЕсли;

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			Строка(ТекущийСтатус),
			ТекущаяДатаСеанса(),
			"[ТЕСТ]",
			РезультатТекст);

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 5: Ошибка проверки статуса: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка проверки итогового статуса", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 6: Отправить тестовый документ в папку обмена
	// ========================================================
	Попытка
		ДанныеДокумента = ЭАрМ_ОбменСДругойБазой.ПодготовитьДанныеДокумента(ТестовыйДокумент);
		ДанныеДокумента.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
		ДанныеДокумента.Вставить("ТипОтправки", "Тест");
		ДанныеДокумента.Вставить("Комментарий", "[ТЕСТ] Тестовая отправка ЗаказПокупателя");

		// Формируем JSON
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеДокумента);
		ТелоЗапроса = ЗаписьJSON.Закрыть();

		// Получаем путь к папке (по умолчанию — тестовая папка)
		ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
		Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
			ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
		КонецЕсли;

		// Создаем папку если не существует
		Каталог = Новый Файл(ПутьКПапке);
		Если НЕ Каталог.Существует() Тогда
			СоздатьКаталог(ПутьКПапке);
		КонецЕсли;

		// Сохраняем файл
		ИмяФайла = СтрШаблон("etrn_%1.json", ИдентификаторЗапроса);
		ПолныйПуть = ПутьКПапке + "\" + ИмяФайла;

		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
		ЗаписьТекста.Записать(ТелоЗапроса);
		ЗаписьТекста.Закрыть();

		ЗаписьЖурналаРегистрации("АРМ_ЭДО.ТестЗаказПокупателя.Папка",
			УровеньЖурналаРегистрации.Информация, , ТестовыйДокумент,
			СтрШаблон("Тестовый файл %1 сохранен в папку %2", ИмяФайла, ПутьКПапке));

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"ОтправленВПапку",
			ТекущаяДатаСеанса(),
			"[ТЕСТ] Папка",
			СтрШаблон("Шаг 6: Тестовый файл %1 отправлен в папку %2",
				ИмяФайла, ПутьКПапке));

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 6: Ошибка отправки в папку: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Ошибка отправки в папку обмена", Журнал);
	КонецПопытки;

	// ========================================================
	// Шаг 7: Сымитировать регламентное задание (проверка папки)
	// ========================================================
	Попытка
		ЭАрМ_ОбработкаПодтвержденийЭДО.ПроверитьПапкуОбмена();

		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"РегламентноеВыполнено",
			ТекущаяДатаСеанса(),
			"[ТЕСТ] Регламентное задание",
			"Шаг 7: Регламентное задание проверки папки выполнено");

	Исключение
		ДобавитьСтрокуЖурнала(Журнал,
			Строка(ТестовыйДокумент),
			ИдентификаторЗапроса,
			"Ошибка",
			ТекущаяДатаСеанса(),
			"",
			"Шаг 7: Ошибка регламентного задания: "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	// ========================================================
	// ИТОГ
	// ========================================================
	ИтоговыйРезультат = "ТЕСТ ЗАКАЗ ПОКУПАТЕЛЯ ПРОЙДЕН: "
		+ "документ создан → регистр записан → регистр проверен → "
		+ "callback обработан → статус Подтверждено → "
		+ "файл отправлен в папку → регламентное задание выполнено";

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ТестЗаказПокупателя",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("=== ИТОГ: %1 ===", ИтоговыйРезультат));

	Возврат Новый Структура("Результат, ЖурналОтправок", ИтоговыйРезультат, Журнал);

КонецФункции

// Загружает текущий журнал отправок из регистра.
//
// Возвращаемое значение:
//   Массив из Структура - строки журнала
//
Функция ЗагрузитьЖурналОтправок() Экспорт

	Журнал = Новый Массив;

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ЭлектронныйДокумент КАК Документ,
		|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	Т.Статус КАК Статус,
		|	Т.ДатаОтправки КАК ДатаОтправки,
		|	Т.ДатаОтвета КАК ДатаОтвета,
		|	Т.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
		|УПОРЯДОЧИТЬ ПО
		|	Т.ДатаОтправки УБЫВ";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Строка = Новый Структура;
			Строка.Вставить("Документ", Строка(Выборка.Документ));
			Строка.Вставить("ИдентификаторЗапроса", Выборка.ИдентификаторЗапроса);
			Строка.Вставить("Статус", Строка(Выборка.Статус));
			Строка.Вставить("ДатаОтправки", Выборка.ДатаОтправки);
			Строка.Вставить("ДатаОтвета", Выборка.ДатаОтвета);
			Строка.Вставить("Комментарий", Выборка.Комментарий);
			Строка.Вставить("Результат", "");
			Журнал.Добавить(Строка);
		КонецЦикла;

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ЗагрузкаЖурнала'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Журнал;

КонецФункции

// Проверяет доступность web-сервиса другой базы.
//
// Возвращаемое значение:
//   Структура - Доступен (Булево), Ошибка (Строка)
//
Функция ПроверитьПодключениеКСервису() Экспорт

	Результат = Новый Структура("Доступен, Ошибка", Ложь, "");

	Попытка
		АдресСервиса = Константы.ЭАрМ_АдресСервисаОбменаСДругойБазой.Получить();
		Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
			Результат.Ошибка = "Адрес сервиса не задан";
			Возврат Результат;
		КонецЕсли;

		АдресWSDL = АдресСервиса + "/ws/Exchange_3_0_2_2?wsdl";
		Определения = Новый WSОпределения(АдресWSDL, "", "");
		Результат.Доступен = Истина;

	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Создает тестовый файл ответа response_*.json в папке обмена.
// Используется для имитации ответа от базы 2 при тестировании.
//
// Параметры:
//   ИдентификаторЗапроса - Строка - UUID запроса для ответа
//   Подтверждено - Булево - Истина если подтверждено, Ложь если отклонено
//   Комментарий - Строка - комментарий к ответу
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ПутьКФайлу (Строка)
//
Функция СоздатьТестовыйОтвет(ИдентификаторЗапроса, Подтверждено = Истина,
	Комментарий = "[ТЕСТ] Ответ от базы 2") Экспорт

	Результат = Новый Структура("Результат, ПутьКФайлу", "", "");

	// Получаем путь к папке
	ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
	Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
		ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
	КонецЕсли;

	// Создаем папку если не существует
	Каталог = Новый Файл(ПутьКПапке);
	Если НЕ Каталог.Существует() Тогда
		СоздатьКаталог(ПутьКПапке);
	КонецЕсли;

	// Формируем JSON ответа
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("requestId", ИдентификаторЗапроса);
	ДанныеОтвета.Вставить("approved", Подтверждено);
	ДанныеОтвета.Вставить("comment", Комментарий);
	ДанныеОтвета.Вставить("processedAt", ТекущаяДатаСеанса());
	ДанныеОтвета.Вставить("source", "База2_Далион");

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
	ТелоОтвета = ЗаписьJSON.Закрыть();

	// Сохраняем файл
	ИмяФайла = СтрШаблон("response_%1.json", ИдентификаторЗапроса);
	ПолныйПуть = ПутьКПапке + "\" + ИмяФайла;

	Попытка
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
		ЗаписьТекста.Записать(ТелоОтвета);
		ЗаписьТекста.Закрыть();

		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СозданиеТестовогоОтвета",
			УровеньЖурналаРегистрации.Информация, , ,
			СтрШаблон("Создан тестовый ответ: %1 (approved=%2)", ИмяФайла, Подтверждено));

		Результат.Результат = СтрШаблон("Файл ответа создан: %1", ПолныйПуть);
		Результат.ПутьКФайлу = ПолныйПуть;

	Исключение
		Результат.Результат = "Ошибка: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СозданиеТестовогоОтвета",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Имитирует регламентное задание: проверяет папку обмена на наличие
// ответных файлов response_*.json от базы 2 и обрабатывает их.
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив из Структура)
//
Функция ИмитироватьРегламентноеЗадание() Экспорт

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияРеглЗадания",
		УровеньЖурналаРегистрации.Информация, , ,
		"=== СТАРТ: Имитация регламентного задания ===");

	Журнал = Новый Массив;
	КоличествоОбработано = 0;
	КоличествоОшибок = 0;

	// Получаем путь к папке (по умолчанию — тестовая папка)
	ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
	Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
		ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
	КонецЕсли;

	Каталог = Новый Файл(ПутьКПапке);
	Если НЕ Каталог.Существует() Тогда
		ДобавитьСтрокуЖурнала(Журнал,
			"<Папка не найдена>",
			"",
			"Пропущен",
			ТекущаяДатаСеанса(),
			"",
			СтрШаблон("Папка %1 не существует", ПутьКПапке));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Папка обмена не найдена: " + ПутьКПапке, Журнал);
	КонецЕсли;

	// Ищем файлы ответов response_*.json
	НайденныеФайлы = НайтиФайлы(ПутьКПапке, "response_*.json");

	Если НайденныеФайлы.Количество() = 0 Тогда
		ДобавитьСтрокуЖурнала(Журнал,
			"<Нет ответов>",
			"",
			"Пропущен",
			ТекущаяДатаСеанса(),
			"",
			СтрШаблон("В папке %1 нет файлов response_*.json от базы 2", ПутьКПапке));
		Возврат Новый Структура("Результат, ЖурналОтправок",
			"Нет ответных файлов от базы 2", Журнал);
	КонецЕсли;

	Для Каждого Файл Из НайденныеФайлы Цикл

		Попытка
			// Читаем файл ответа
			ЧтениеТекста = Новый ЧтениеТекста(Файл.ПолноеИмя, КодировкаТекста.UTF8);
			Содержимое = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();

			// Убираем BOM если есть
			Если Лев(Содержимое, 1) = Символ(65279) Тогда
				Содержимое = Сред(Содержимое, 2);
			КонецЕсли;

			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СокрЛП(Содержимое));
			Данные = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Если НЕ Данные.Свойство("requestId") ИЛИ НЕ Данные.Свойство("approved") Тогда
				ДобавитьСтрокуЖурнала(Журнал,
					Файл.Имя,
					"",
					"Пропущен",
					ТекущаяДатаСеанса(),
					"",
					"Файл не содержит requestId или approved");
				Продолжить;
			КонецЕсли;

			// Обрабатываем ответ от базы 2
			ЭАрМ_ОбработкаПодтвержденийЭДО.ОбработатьОтветПодтверждения(
				Данные.requestId,
				Данные.approved,
				?(Данные.Свойство("comment"), Данные.comment, ""));

			// Архивируем обработанный файл
			АрхивПуть = ПутьКПапке + "\archive";
			АрхивКаталог = Новый Файл(АрхивПуть);
			Если НЕ АрхивКаталог.Существует() Тогда
				СоздатьКаталог(АрхивПуть);
			КонецЕсли;
			ПереместитьФайл(Файл.ПолноеИмя, АрхивПуть + "\" + Файл.Имя);

			КоличествоОбработано = КоличествоОбработано + 1;

			СтатусОтвета = ?(Данные.approved, "Подтверждено", "Отклонено");

			ДобавитьСтрокуЖурнала(Журнал,
				Данные.requestId,
				Данные.requestId,
				СтатусОтвета,
				ТекущаяДатаСеанса(),
				?(Данные.Свойство("comment"), Данные.comment, ""),
				СтрШаблон("Ответ от базы 2 обработан: %1 (файл %2)", СтатусОтвета, Файл.Имя));

			ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияРеглЗадания",
				УровеньЖурналаРегистрации.Информация, , ,
				СтрШаблон("Обработан ответ: requestId=%1, approved=%2",
					Данные.requestId, Данные.approved));

		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;

			ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияРеглЗадания",
				УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			ДобавитьСтрокуЖурнала(Журнал,
				Файл.Имя,
				"",
				"Ошибка",
				ТекущаяДатаСеанса(),
				"",
				"Ошибка обработки: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;

	КонецЦикла;

	Итог = СтрШаблон("Обработано ответов: %1, ошибок: %2 (папка: %3)",
		КоличествоОбработано, КоличествоОшибок, ПутьКПапке);

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияРеглЗадания",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("=== ИТОГ: %1 ===", Итог));

	Возврат Новый Структура("Результат, ЖурналОтправок", Итог, Журнал);

КонецФункции

// Отправляет в папку обмена все документы из регистра, находящиеся в статусе "Ожидает".
// Используется когда документ уже создан и записан в регистр, и нужно вызвать отправку в папку.
//
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив из Структура)
//
Функция ОтправитьОжидacyеВПапку() Экспорт

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОтправкаОжидавшихВПапку",
		УровеньЖурналаРегистрации.Информация, , ,
		"=== СТАРТ: Отправка ожидающих документов в папку ===");

	Журнал = Новый Массив;
	КоличествоОправлено = 0;
	КоличествоОшибок = 0;
	МассивДокументов = Новый Массив;
	ИдентификаторФайла = Строка(Новый УникальныйИдентификатор);

	// Находим все документы в статусе "Ожидает"
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	|	Т.ДатаОтправки КАК ДатаОтправки,
	|	Т.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|	Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает)";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДобавитьСтрокуЖурнала(Журнал, "<Нет документов>", "", "Пропущен", ТекущаяДатаСеанса(), "", "Нет документов в статусе 'Ожидает'");
		Возврат Новый Структура("Результат, ЖурналОтправок", "Нет документов в статусе Ожидает", Журнал);
	КонецЕсли;

	// Собираем все документы в массив
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлектронныйДокумент = Выборка.ЭлектронныйДокумент;
		ИдентификаторЗапроса = Выборка.ИдентификаторЗапроса;

		Попытка
			Попытка
				ДанныеДокумента = ЭАрМ_ОбменСДругойБазой.ПодготовитьДанныеДокумента(ЭлектронныйДокумент);
			Исключение
				ДанныеДокумента = ПодготовитьДанныеНеЭДОДокумента(ЭлектронныйДокумент);
			КонецПопытки;
			ДанныеДокумента.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
			ДанныеДокумента.Вставить("ТипОтправки", "Тест");
			ДанныеДокумента.Вставить("Комментарий", ?(ЗначениеЗаполнено(Выборка.Комментарий), Выборка.Комментарий, "[ТЕСТ] Отправка в папку"));
			МассивДокументов.Добавить(ДанныеДокумента);
			КоличествоОправлено = КоличествоОправлено + 1;
		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;
			ДобавитьСтрокуЖурнала(Журнал, Строка(ЭлектронныйДокумент), ИдентификаторЗапроса, "Ошибка", ТекущаяДатаСеанса(), "", "Ошибка: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	// Формируем JSON-массив
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивДокументов);
	ТелоЗапроса = ЗаписьJSON.Закрыть();

	// Получаем путь к папке
	ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
	Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
		ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
	КонецЕсли;

	Каталог = Новый Файл(ПутьКПапке);
	Если НЕ Каталог.Существует() Тогда
		СоздатьКаталог(ПутьКПапке);
	КонецЕсли;

	// Сохраняем файл с именем etrn_{UUID}.json
	ИмяФайла = СтрШаблон("etrn_%1.json", ИдентификаторФайла);
	ПолныйПуть = ПутьКПапке + "\" + ИмяФайла;

	ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(ТелоЗапроса);
	ЗаписьТекста.Закрыть();

	ДобавитьСтрокуЖурнала(Журнал, "Всего: " + КоличествоОправлено, ИдентификаторФайла, "ОтправленВПапку", ТекущаяДатаСеанса(), "[ТЕСТ]", СтрШаблон("Файл %1 (%2 док.) в папку %3", ИмяФайла, КоличествоОправлено, ПутьКПапке));

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОтправкаОжидавшихВПапку", УровеньЖурналаРегистрации.Информация, , , СтрШаблон("=== ИТОГ: отправлено %1, ошибок %2 ===", КоличествоОправлено, КоличествоОшибок));

	Возврат Новый Структура("Результат, ЖурналОтправок", СтрШаблон("Отправлено: %1, ошибок: %2", КоличествоОправлено, КоличествоОшибок), Журнал);

КонецФункции

// Читает JSON-файл и возвращает ТаблицаЗначений.
// Параметры:
//   ПутьКФайлу - Строка - полный путь к JSON-файлу
// Возвращаемое значение:
//   Структура - Таблица (ТаблицаЗначений), КоличествоСтрок (Число), Ошибка (Строка)
//
Функция ПрочитатьФайлВТаблицуЗначений(ПутьКФайлу) Экспорт

	Результат = Новый Структура("Таблица, КоличествоСтрок, Ошибка", Неопределено, 0, "");

	Попытка
		Файл = Новый Файл(ПутьКФайлу);
		Если НЕ Файл.Существует() Тогда
			Результат.Ошибка = СтрШаблон("Файл не найден: %1", ПутьКФайлу);
			Возврат Результат;
		КонецЕсли;

		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
		Содержимое = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Содержимое);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();

		// Если данные — массив, берём первый элемент
		ДокументДляОбработки = ?(ТипЗнч(Данные) = Тип("Массив"), Данные[0], Данные);

		// Формируем таблицу значений
		Таблица = Новый ТаблицаЗначений;
		ТабличныеЧастиДанных = Неопределено;

		// Добавляем колонки из реквизитов шапки
		Для Каждого КлючЗначение Из ДокументДляОбработки Цикл
			Если КлючЗначение.Ключ = "ТабличныеЧасти" Тогда
				ТабличныеЧастиДанных = КлючЗначение.Значение;
				Продолжить;
			КонецЕсли;
			ТипЗначения = ТипЗнч(КлючЗначение.Значение);
			Таблица.Колонки.Добавить(КлючЗначение.Ключ, Новый ОписаниеТипов(Новый Массив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначения))));
		КонецЦикла;

		// Добавляем строку шапки
		НоваяСтрока = Таблица.Добавить();
		Для Каждого КлючЗначение Из ДокументДляОбработки Цикл
			Если КлючЗначение.Ключ = "ТабличныеЧасти" Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;

		// Если есть табличные части — добавляем их как отдельные таблицы
		Если ТабличныеЧастиДанных <> Неопределено Тогда
			Для Каждого КлючТЧ Из ТабличныеЧастиДанных Цикл
				ИмяТЧ = КлючТЧ.Ключ;
				СтрокиТЧ = КлючТЧ.Значение;

				Если ТипЗнч(СтрокиТЧ) = Тип("Массив") И СтрокиТЧ.Количество() > 0 Тогда
					Для Каждого Колонка Из СтрокиТЧ[0] Цикл
						Таблица.Колонки.Добавить(ИмяТЧ + "_" + Колонка.Ключ);
					КонецЦикла;

					// Заполняем данные ТЧ в первые строки
					Для Сч = 0 По СтрокиТЧ.ВГраница() Цикл
						Если Сч >= Таблица.Количество() Тогда
							Таблица.Добавить();
						КонецЕсли;
						Для Каждого Колонка Из СтрокиТЧ[Сч] Цикл
							Таблица[Сч][ИмяТЧ + "_" + Колонка.Ключ] = Колонка.Значение;
						КонецЦикла;
				КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Результат.Таблица = Таблица;
		Результат.КоличествоСтрок = Таблица.Количество();

	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Имитирует событие изменения статуса: создаёт response-файл и меняет статус в регистре.
// Возвращаемое значение:
//   Структура - Результат (Строка), ЖурналОтправок (Массив)
//
Функция ИмитироватьСобытиеИзмененияСтатуса() Экспорт

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияСобытияСтатуса", УровеньЖурналаРегистрации.Информация, , , "=== СТАРТ: Имитация события изменения статуса ===");

	Журнал = Новый Массив;
	КоличествоОбработано = 0;

	// Находим все документы в статусе "Ожидает"
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|Т.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса
	|ИЗ
	|РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает)";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДобавитьСтрокуЖурнала(Журнал, "<Нет документов>", "", "Пропущен", ТекущаяДатаСеанса(), "", "Нет документов в статусе 'Ожидает'");
		Возврат Новый Структура("Результат, ЖурналОтправок", "Нет документов для обработки", Журнал);
	КонецЕсли;

	// Получаем путь к папке
	ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
	Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
		ПутьКПапке = "C:\Users\azhel\Desktop\АРМ_ТестЭдо\Data";
	КонецЕсли;

	Каталог = Новый Файл(ПутьКПапке);
	Если НЕ Каталог.Существует() Тогда
		СоздатьКаталог(ПутьКПапке);
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		ИдентификаторЗапроса = Выборка.ИдентификаторЗапроса;

		Попытка
			// Создаём response-файл
			ДанныеОтвета = Новый Структура;
			ДанныеОтвета.Вставить("requestId", ИдентификаторЗапроса);
			ДанныеОтвета.Вставить("approved", Истина);
			ДанныеОтвета.Вставить("comment", "[ТЕСТ] Обработано базой 2");
			ДанныеОтвета.Вставить("processedAt", ТекущаяДатаСеанса());
			ДанныеОтвета.Вставить("source", "База2_Далион");

			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
			ТелоОтвета = ЗаписьJSON.Закрыть();

			ИмяФайла = СтрШаблон("response_%1.json", ИдентификаторЗапроса);
			ПолныйПуть = ПутьКПапке + "\" + ИмяФайла;

			ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть, КодировкаТекста.UTF8);
			ЗаписьТекста.Записать(ТелоОтвета);
			ЗаписьТекста.Закрыть();

			// Обрабатываем ответ — меняем статус
			ЭАрМ_ОбработкаПодтвержденийЭДО.ОбработатьОтветПодтверждения(ИдентификаторЗапроса, Истина, "[ТЕСТ] Статус изменён");

			КоличествоОбработано = КоличествоОбработано + 1;

			ДобавитьСтрокуЖурнала(Журнал, Строка(Выборка.ЭлектронныйДокумент), ИдентификаторЗапроса, "Подтверждено", ТекущаяДатаСеанса(), "[ТЕСТ]", СтрШаблон("Статус изменён, response создан: %1", ИмяФайла));

		Исключение
			ДобавитьСтрокуЖурнала(Журнал, "", ИдентификаторЗапроса, "Ошибка", ТекущаяДатаСеанса(), "", "Ошибка: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;

	КонецЦикла;

	Итог = СтрШаблон("Обработано: %1", КоличествоОбработано);
	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ИмитацияСобытияСтатуса", УровеньЖурналаРегистрации.Информация, , , СтрШаблон("=== ИТОГ: %1 ===", Итог));

	Возврат Новый Структура("Результат, ЖурналОтправок", Итог, Журнал);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подготавливает данные для не-ЭДО документа (ЗаказКлиента и т.п.).
//
Функция ПодготовитьДанныеНеЭДОДокумента(ДокументСсылка)

	МетаДокумент = ДокументСсылка.Метаданные();
	Данные = Новый Структура;

	// Стандартные реквизиты
	Для Каждого Рекв Из МетаДокумент.СтандартныеРеквизиты Цикл
		Попытка
			ЗначениеРекв = ДокументСсылка[Рекв.Имя];
			Если ТипЗнч(ЗначениеРекв) = Тип("СсылкаНаОбъектМетаданных") Тогда
				Данные.Вставить(Рекв.Имя, Строка(ЗначениеРекв));
			Иначе
				Данные.Вставить(Рекв.Имя, ЗначениеРекв);
			КонецЕсли;
		Исключение
			Данные.Вставить(Рекв.Имя, Неопределено);
		КонецПопытки;
	КонецЦикла;

	// Реквизиты шапки документа
	ИменаРеквизитов = Новый Массив;
	Для Каждого Рекв Из МетаДокумент.Реквизиты Цикл
		ИменаРеквизитов.Добавить(Рекв.Имя);
	КонецЦикла;

	Если ИменаРеквизитов.Количество() > 0 Тогда
		Попытка
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
				СтрСоединить(ИменаРеквизитов, ", "));
			Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
				ЗначениеРекв = КлючЗначение.Значение;
				Если ТипЗнч(ЗначениеРекв) = Тип("СсылкаНаОбъектМетаданных") Тогда
					Данные.Вставить(КлючЗначение.Ключ, Строка(ЗначениеРекв));
				Иначе
					Данные.Вставить(КлючЗначение.Ключ, ЗначениеРекв);
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Данные.Вставить("СсылкаСтрока", ПолучитьНавигационнуюСсылку(ДокументСсылка));
	Данные.Вставить("ТипДокумента", МетаДокумент.Имя);
	Данные.Вставить("Представление", Строка(ДокументСсылка));
	Данные.Вставить("ЭтоТест", Истина);

	// Табличные части
	ТабличныеЧасти = Новый Структура;

	Для Каждого ТабличнаяЧасть Из МетаДокумент.ТабличныеЧасти Цикл
		ИмяТЧ = ТабличнаяЧасть.Имя;

		ИменаКолонок = Новый Массив;
		Для Каждого РеквТЧ Из ТабличнаяЧасть.Реквизиты Цикл
			ИменаКолонок.Добавить(РеквТЧ.Имя);
		КонецЦикла;

		Попытка
			Выборка = ДокументСсылка[ИмяТЧ].Выбрать();
			СтрокиТЧ = Новый Массив;

			Пока Выборка.Следующий() Цикл
				СтрокаДанных = Новый Структура("НомерСтроки", Выборка.НомерСтроки);
				Для Каждого ИмяКолонки Из ИменаКолонок Цикл
					Попытка
						ЗначениеКолонки = Выборка[ИмяКолонки];
						Если ТипЗнч(ЗначениеКолонки) = Тип("СсылкаНаОбъектМетаданных") Тогда
							СтрокаДанных.Вставить(ИмяКолонки, Строка(ЗначениеКолонки));
						Иначе
							СтрокаДанных.Вставить(ИмяКолонки, ЗначениеКолонки);
						КонецЕсли;
					Исключение
						СтрокаДанных.Вставить(ИмяКолонки, Неопределено);
					КонецПопытки;
				КонецЦикла;
				СтрокиТЧ.Добавить(СтрокаДанных);
			КонецЦикла;

			ТабличныеЧасти.Вставить(ИмяТЧ, СтрокиТЧ);
		Исключение
			ТабличныеЧасти.Вставить(ИмяТЧ, Новый Массив);
		КонецПопытки;
	КонецЦикла;

	Данные.Вставить("ТабличныеЧасти", ТабличныеЧасти);

	Возврат Данные;

КонецФункции

Процедура ДобавитьСтрокуЖурнала(Журнал, Документ, ИдентификаторЗапроса, Статус, Дата, Комментарий, Результат)

	Строка = Новый Структура;
	Строка.Вставить("Документ", Строка(Документ));
	Строка.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	Строка.Вставить("Статус", Статус);
	Строка.Вставить("ДатаОтправки", Дата);
	Строка.Вставить("ДатаОтвета", Неопределено);
	Строка.Вставить("Комментарий", Комментарий);
	Строка.Вставить("Результат", Результат);
	Журнал.Добавить(Строка);

КонецПроцедуры

#КонецОбласти
